; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=98, out_folder=htg/blocksworld//training, instance_id=78, seed=2102

(define (problem blocksworld-78)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b6)
    (on b6 b17)
    (on b17 b41)
    (on b41 b42)
    (on b42 b32)
    (on b32 b2)
    (on b2 b95)
    (on b95 b25)
    (on b25 b88)
    (on b88 b8)
    (on b8 b59)
    (on b59 b38)
    (on b38 b49)
    (on b49 b26)
    (on b26 b24)
    (on b24 b97)
    (on-table b97)
    (clear b61)
    (on b61 b71)
    (on b71 b7)
    (on b7 b92)
    (on b92 b47)
    (on-table b47)
    (clear b72)
    (on b72 b27)
    (on-table b27)
    (clear b80)
    (on b80 b51)
    (on b51 b64)
    (on b64 b70)
    (on b70 b16)
    (on b16 b23)
    (on b23 b46)
    (on b46 b54)
    (on b54 b87)
    (on b87 b77)
    (on-table b77)
    (clear b43)
    (on b43 b36)
    (on b36 b81)
    (on b81 b84)
    (on b84 b85)
    (on b85 b48)
    (on b48 b98)
    (on b98 b73)
    (on b73 b34)
    (on b34 b96)
    (on-table b96)
    (clear b69)
    (on b69 b91)
    (on b91 b58)
    (on b58 b10)
    (on-table b10)
    (clear b66)
    (on-table b66)
    (clear b76)
    (on b76 b93)
    (on b93 b78)
    (on b78 b52)
    (on b52 b21)
    (on b21 b37)
    (on b37 b45)
    (on b45 b33)
    (on b33 b12)
    (on b12 b15)
    (on b15 b56)
    (on b56 b20)
    (on b20 b75)
    (on b75 b67)
    (on b67 b4)
    (on b4 b35)
    (on-table b35)
    (clear b28)
    (on b28 b30)
    (on b30 b62)
    (on b62 b86)
    (on b86 b18)
    (on b18 b19)
    (on b19 b63)
    (on b63 b94)
    (on b94 b44)
    (on-table b44)
    (clear b5)
    (on b5 b9)
    (on-table b9)
    (clear b53)
    (on b53 b50)
    (on b50 b29)
    (on b29 b3)
    (on b3 b31)
    (on b31 b79)
    (on b79 b82)
    (on b82 b13)
    (on b13 b22)
    (on b22 b11)
    (on b11 b55)
    (on b55 b57)
    (on b57 b89)
    (on-table b89)
    (clear b83)
    (on b83 b68)
    (on b68 b74)
    (on b74 b40)
    (on b40 b60)
    (on b60 b14)
    (on b14 b65)
    (on b65 b90)
    (on b90 b39)
    (on-table b39))
 (:goal  (and 
    (clear b8)
    (on b8 b7)
    (on b7 b1)
    (on b1 b9)
    (on b9 b5)
    (on b5 b2)
    (on b2 b6)
    (on b6 b4)
    (on-table b4)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 0 of 11
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 11
3. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 0 of 11
4. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 1 of 11
5. (unstack b1 b6)
   deleted: (on b1 b6) (clear b1) (arm-empty)
   added: (holding b1) (clear b6)
   goals met: 1 of 11
6. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 2 of 11
7. (unstack b53 b50)
   deleted: (on b53 b50) (clear b53) (arm-empty)
   added: (holding b53) (clear b50)
   goals met: 2 of 11
8. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 11
9. (unstack b50 b29)
   deleted: (on b50 b29) (clear b50) (arm-empty)
   added: (holding b50) (clear b29)
   goals met: 2 of 11
10. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 2 of 11
11. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 3 of 11
12. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 3 of 11
13. (unstack b3 b31)
   deleted: (on b3 b31) (clear b3) (arm-empty)
   added: (holding b3) (clear b31)
   goals met: 2 of 11
14. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 11
15. (unstack b61 b71)
   deleted: (on b61 b71) (clear b61) (arm-empty)
   added: (holding b61) (clear b71)
   goals met: 4 of 11
16. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 4 of 11
17. (unstack b71 b7)
   deleted: (on b71 b7) (clear b71) (arm-empty)
   added: (holding b71) (clear b7)
   goals met: 4 of 11
18. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 4 of 11
19. (unstack b7 b92)
   deleted: (on b7 b92) (clear b7) (arm-empty)
   added: (holding b7) (clear b92)
   goals met: 4 of 11
20. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 5 of 11
21. (unstack b76 b93)
   deleted: (on b76 b93) (clear b76) (arm-empty)
   added: (holding b76) (clear b93)
   goals met: 5 of 11
22. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 5 of 11
23. (unstack b93 b78)
   deleted: (on b93 b78) (clear b93) (arm-empty)
   added: (holding b93) (clear b78)
   goals met: 5 of 11
24. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 5 of 11
25. (unstack b78 b52)
   deleted: (on b78 b52) (clear b78) (arm-empty)
   added: (holding b78) (clear b52)
   goals met: 5 of 11
26. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 5 of 11
27. (unstack b52 b21)
   deleted: (on b52 b21) (clear b52) (arm-empty)
   added: (holding b52) (clear b21)
   goals met: 5 of 11
28. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 5 of 11
29. (unstack b21 b37)
   deleted: (on b21 b37) (clear b21) (arm-empty)
   added: (holding b21) (clear b37)
   goals met: 5 of 11
30. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 5 of 11
31. (unstack b37 b45)
   deleted: (on b37 b45) (clear b37) (arm-empty)
   added: (holding b37) (clear b45)
   goals met: 5 of 11
32. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 5 of 11
33. (unstack b45 b33)
   deleted: (on b45 b33) (clear b45) (arm-empty)
   added: (holding b45) (clear b33)
   goals met: 5 of 11
34. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 5 of 11
35. (unstack b33 b12)
   deleted: (on b33 b12) (clear b33) (arm-empty)
   added: (holding b33) (clear b12)
   goals met: 5 of 11
36. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 5 of 11
37. (unstack b12 b15)
   deleted: (on b12 b15) (clear b12) (arm-empty)
   added: (holding b12) (clear b15)
   goals met: 5 of 11
38. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 11
39. (unstack b15 b56)
   deleted: (on b15 b56) (clear b15) (arm-empty)
   added: (holding b15) (clear b56)
   goals met: 5 of 11
40. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 11
41. (unstack b56 b20)
   deleted: (on b56 b20) (clear b56) (arm-empty)
   added: (holding b56) (clear b20)
   goals met: 5 of 11
42. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 5 of 11
43. (unstack b20 b75)
   deleted: (on b20 b75) (clear b20) (arm-empty)
   added: (holding b20) (clear b75)
   goals met: 5 of 11
44. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 5 of 11
45. (unstack b75 b67)
   deleted: (on b75 b67) (clear b75) (arm-empty)
   added: (holding b75) (clear b67)
   goals met: 5 of 11
46. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 5 of 11
47. (unstack b67 b4)
   deleted: (on b67 b4) (clear b67) (arm-empty)
   added: (holding b67) (clear b4)
   goals met: 5 of 11
48. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 5 of 11
49. (unstack b4 b35)
   deleted: (on b4 b35) (clear b4) (arm-empty)
   added: (holding b4) (clear b35)
   goals met: 5 of 11
50. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 11
51. (unstack b6 b17)
   deleted: (on b6 b17) (clear b6) (arm-empty)
   added: (holding b6) (clear b17)
   goals met: 6 of 11
52. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 7 of 11
53. (unstack b17 b41)
   deleted: (on b17 b41) (clear b17) (arm-empty)
   added: (holding b17) (clear b41)
   goals met: 7 of 11
54. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 7 of 11
55. (unstack b41 b42)
   deleted: (on b41 b42) (clear b41) (arm-empty)
   added: (holding b41) (clear b42)
   goals met: 7 of 11
56. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 7 of 11
57. (unstack b42 b32)
   deleted: (on b42 b32) (clear b42) (arm-empty)
   added: (holding b42) (clear b32)
   goals met: 7 of 11
58. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 7 of 11
59. (unstack b32 b2)
   deleted: (on b32 b2) (clear b32) (arm-empty)
   added: (holding b32) (clear b2)
   goals met: 7 of 11
60. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 7 of 11
61. (unstack b2 b95)
   deleted: (on b2 b95) (clear b2) (arm-empty)
   added: (holding b2) (clear b95)
   goals met: 7 of 11
62. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 8 of 11
63. (unstack b95 b25)
   deleted: (on b95 b25) (clear b95) (arm-empty)
   added: (holding b95) (clear b25)
   goals met: 8 of 11
64. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 8 of 11
65. (unstack b25 b88)
   deleted: (on b25 b88) (clear b25) (arm-empty)
   added: (holding b25) (clear b88)
   goals met: 8 of 11
66. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 8 of 11
67. (unstack b88 b8)
   deleted: (on b88 b8) (clear b88) (arm-empty)
   added: (holding b88) (clear b8)
   goals met: 9 of 11
68. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 9 of 11
69. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 8 of 11
70. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 11
71. (unstack b8 b59)
   deleted: (on b8 b59) (clear b8) (arm-empty)
   added: (holding b8) (clear b59)
   goals met: 7 of 11
72. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 9 of 11
73. (unstack b1 b9)
   deleted: (on b1 b9) (clear b1) (arm-empty)
   added: (holding b1) (clear b9)
   goals met: 8 of 11
74. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 8 of 11
75. (unstack b9 b5)
   deleted: (on b9 b5) (clear b9) (arm-empty)
   added: (holding b9) (clear b5)
   goals met: 7 of 11
76. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 7 of 11
77. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 11
78. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 8 of 11
79. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 11
80. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 9 of 11
81. (unstack b1 b9)
   deleted: (on b1 b9) (clear b1) (arm-empty)
   added: (holding b1) (clear b9)
   goals met: 8 of 11
82. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 8 of 11
83. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 8 of 11
84. (stack b9 b95)
   deleted: (clear b95) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b95)
   goals met: 8 of 11
85. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 8 of 11
86. (stack b1 b88)
   deleted: (clear b88) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b88)
   goals met: 8 of 11
87. (unstack b9 b95)
   deleted: (on b9 b95) (clear b9) (arm-empty)
   added: (holding b9) (clear b95)
   goals met: 8 of 11
88. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 9 of 11
89. (unstack b1 b88)
   deleted: (on b1 b88) (clear b1) (arm-empty)
   added: (holding b1) (clear b88)
   goals met: 9 of 11
90. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 10 of 11
91. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 8 of 11
92. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 9 of 11
93. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 11
94. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 10 of 11
95. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 11
96. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 11 of 11
